src/Catalogs/уатВидыОбслуживанияТС/уатВидыОбслуживанияТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатВидыОбслуживанияТС</name>
  <comment>Виды обслуживания ТС (уат)</comment>
  <attributes>
    <name>ВидОбслуживанияТС</name>
    <type>
      <types>EnumRef.уатВидыОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВПланированииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветВидаОбслуживания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенДляВыбораВМобильномПриложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Циклический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.уатСтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/уатВидыОбслуживания/уатВидыОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОбслуживания</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>ВводВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПеремещение</name>
  </enumValues>
  <enumValues>
    <name>Дооборудование</name>
  </enumValues>
  <enumValues>
    <name>Достройка</name>
  </enumValues>
  <enumValues>
    <name>КапитальныйРемонт</name>
  </enumValues>
  <enumValues>
    <name>Модернизация</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизации</name>
  </enumValues>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ПодготовкаКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ПринятиеКУчетуСВводомВЭкплуатацию</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочие состояния (пользовательские)</comment>
  </enumValues>
  <enumValues>
    <name>Реконструкция</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>СреднийРемонт</name>
  </enumValues>
  <enumValues>
    <name>ТекущийРемонт</name>
  </enumValues>
  <enumValues>
    <name>Техобслуживание</name>
  </enumValues>
  <enumValues>
    <name>ЧастичнаяЛиквидация</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатВидыОбслуживанияТС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;

	ТекущийЦвет = РеквизитФормыВЗначение("Объект").ЦветВидаОбслуживания.Получить();
	ЦветВидаОбслуживания = ТекущийЦвет;	
	
	Элементы.ВидОбслуживанияТС.СписокВыбора.Очистить();
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.ТекущийРемонт")    , НСтр("en='Running repair';ru='Текущий ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Техобслуживание")  , НСтр("ru='Техобслуживание'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.СреднийРемонт")    , НСтр("en='Medium repair';ru='Средний ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.КапитальныйРемонт"), НСтр("en='Overhaul';ru='Капитальный ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Дооборудование")   , НСтр("en='AdditionalEquipment';ru='Дооборудование'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Модернизация")     , НСтр("en='Renovation';ru='Модернизация'"));

	Элементы.ДоступенДляВыбораВМобильномПриложении.Видимость = НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветВидаОбслуживания = Новый ХранилищеЗначения(ЦветВидаОбслуживания,Новый СжатиеДанных(9));
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТекущийЦвет = ТекущийОбъект.ЦветВидаОбслуживания.Получить();
	ЦветВидаОбслуживания = ТекущийЦвет;
КонецПроцедуры

#КонецОбласти
